; domain
(define (domain snake)
(:requirements :equality :negative-preconditions)
(:constants
    dummypoint
)
(:predicates
    ;up down left right of a field
    (ISADJACENT ?x ?y)
    ;the last field of the snake
    (tailsnake ?x)
    ;the first field of the snake
    (headsnake ?x)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y)
    ;a field that is occupied by the snake or by an obstacle
    (blocked ?x)
    ;next point that will spawn
    (spawn ?x)
    ;point y will spawn after point x
    (NEXTSPAWN ?x ?y)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x)
)
(:action move
    :parameters (?head ?newhead ?tail ?newtail)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)

(:action move-and-eat-spawn
    :parameters (?head ?newhead ?spawnpoint ?nextspawnpoint)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn ?spawnpoint)
        (NEXTSPAWN ?spawnpoint ?nextspawnpoint)
        (not (= ?spawnpoint dummypoint))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (ispoint ?spawnpoint)
        (not (spawn ?spawnpoint))
        (spawn ?nextspawnpoint)
    )
)

(:action move-and-eat-no-spawn
    :parameters (?head ?newhead)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn dummypoint)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)

)

; problem
(define (problem snake-empty-3x3-1-5-1-134)
(:domain snake)
(:objects
    pos0-0 pos0-1 pos0-2 pos1-0 pos1-1 pos1-2 pos2-0 pos2-1 pos2-2
)
(:init
    (isAdjacent pos0-0 pos1-0)
 (isAdjacent pos0-0 pos0-1)
 (isAdjacent pos0-1 pos1-1)
 (isAdjacent pos0-1 pos0-2)
 (isAdjacent pos0-1 pos0-0)
 (isAdjacent pos0-2 pos1-2)
 (isAdjacent pos0-2 pos0-1)
 (isAdjacent pos1-0 pos2-0)
 (isAdjacent pos1-0 pos1-1)
 (isAdjacent pos1-0 pos0-0)
 (isAdjacent pos1-1 pos2-1)
 (isAdjacent pos1-1 pos1-2)
 (isAdjacent pos1-1 pos0-1)
 (isAdjacent pos1-1 pos1-0)
 (isAdjacent pos1-2 pos2-2)
 (isAdjacent pos1-2 pos0-2)
 (isAdjacent pos1-2 pos1-1)
 (isAdjacent pos2-0 pos2-1)
 (isAdjacent pos2-0 pos1-0)
 (isAdjacent pos2-1 pos2-2)
 (isAdjacent pos2-1 pos1-1)
 (isAdjacent pos2-1 pos2-0)
 (isAdjacent pos2-2 pos1-2)
 (isAdjacent pos2-2 pos2-1)
    (tailSnake pos2-1)
    (headSnake pos2-2)
    (nextSnake pos2-2 pos2-1)
    (blocked pos2-1)
 (blocked pos2-2)
    (spawn pos0-1)
 (nextSpawn pos0-1 dummyPoint)
    (isPoint pos1-2)
 (isPoint pos0-2)
 (isPoint pos0-0)
 (isPoint pos2-0)
 (isPoint pos1-1)
)
(:goal (and
    (not (isPoint pos1-2))
 (not (isPoint pos0-2))
 (not (isPoint pos0-0))
 (not (isPoint pos2-0))
 (not (isPoint pos1-1))
 (not (isPoint pos0-1))
))
)

; plan
1. (move-and-eat-spawn pos2-2 pos1-2 pos0-1 dummypoint)
   deleted: (headsnake pos2-2) (ispoint pos1-2) (spawn pos0-1)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos2-2) (ispoint pos0-1) (spawn dummypoint)
   goals met: 1 of 6
2. (move-and-eat-no-spawn pos1-2 pos0-2)
   deleted: (headsnake pos1-2) (ispoint pos0-2)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos1-2)
   goals met: 2 of 6
3. (move-and-eat-no-spawn pos0-2 pos0-1)
   deleted: (headsnake pos0-2) (ispoint pos0-1)
   added: (blocked pos0-1) (headsnake pos0-1) (nextsnake pos0-1 pos0-2)
   goals met: 3 of 6
4. (move-and-eat-no-spawn pos0-1 pos0-0)
   deleted: (headsnake pos0-1) (ispoint pos0-0)
   added: (blocked pos0-0) (headsnake pos0-0) (nextsnake pos0-0 pos0-1)
   goals met: 4 of 6
5. (move pos0-0 pos1-0 pos2-1 pos2-2)
   deleted: (headsnake pos0-0) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos2-2 pos2-1)
   added: (blocked pos1-0) (headsnake pos1-0) (nextsnake pos1-0 pos0-0) (tailsnake pos2-2)
   goals met: 4 of 6
6. (move-and-eat-no-spawn pos1-0 pos1-1)
   deleted: (headsnake pos1-0) (ispoint pos1-1)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos1-0)
   goals met: 5 of 6
7. (move pos1-1 pos2-1 pos2-2 pos1-2)
   deleted: (headsnake pos1-1) (blocked pos2-2) (tailsnake pos2-2) (nextsnake pos1-2 pos2-2)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos1-1) (tailsnake pos1-2)
   goals met: 5 of 6
8. (move-and-eat-no-spawn pos2-1 pos2-0)
   deleted: (headsnake pos2-1) (ispoint pos2-0)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos2-1)
   goals met: 6 of 6
